# Pandas data structures is Series and DataFrame

## Series
>Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [121]:
import numpy as np
import pandas as pd

In [89]:
labels = ['A','B', 'C']
my_data = [10,20,30] 
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [90]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [91]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [92]:
pd.Series(data=my_data, index=labels)

A    10
B    20
C    30
dtype: int64

In [93]:
pd.Series(my_data, labels)

A    10
B    20
C    30
dtype: int64

In [94]:
pd.Series(arr, labels)

A    10
B    20
C    30
dtype: int64

In [95]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [96]:
 pd.Series(labels)

0    A
1    B
2    C
dtype: object

In [97]:
pd.Series([len, sum, print])

0      <built-in function len>
1      <built-in function sum>
2    <built-in function print>
dtype: object

In [98]:
series1 = pd.Series(my_data, labels)
series1

A    10
B    20
C    30
dtype: int64

In [99]:
series1['A']

10

In [100]:
series1['B']

20

In [101]:
series2 = pd.Series(my_data)
series2

0    10
1    20
2    30
dtype: int64

In [102]:
series2[1]

20

In [103]:
series2.add(20)

0    30
1    40
2    50
dtype: int64

In [104]:
series2.apply(lambda n: np.sqrt(n))

0    3.162278
1    4.472136
2    5.477226
dtype: float64

In [105]:
series2.index

RangeIndex(start=0, stop=3, step=1)

In [106]:
series1.index

Index(['A', 'B', 'C'], dtype='object')

In [107]:
series1.drop

<bound method Series.drop of A    10
B    20
C    30
dtype: int64>

In [108]:
labels2 =['W','X', 'Y', 'Z']
series3 = pd.Series(np.random.randint(1, 10, 4), labels2)
series4 = pd.Series(np.random.randint(1, 10, 4), labels2)

In [109]:
series3

W    8
X    3
Y    4
Z    2
dtype: int64

In [110]:
series4

W    7
X    4
Y    5
Z    5
dtype: int64

In [111]:
series3 + series4

W    15
X     7
Y     9
Z     7
dtype: int64

***For sum of multiple series index must be same***

In [112]:
series1 + series2

A   NaN
B   NaN
C   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

## DataFrame

>DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

  1. Dict of 1D ndarrays, lists, dicts, or Series

  2. 2-D numpy.ndarray

  3. Structured or record ndarray

  4. A Series

  5. Another DataFrame

In [117]:
from numpy.random import rand
np.random.seed(101)

In [120]:
pd.DataFrame(rand(5,4))

          0         1         2         3
0  0.189939  0.554228  0.352132  0.181892
1  0.785602  0.965483  0.232354  0.083561
2  0.603548  0.728993  0.276239  0.685306
3  0.517867  0.048485  0.137869  0.186967
4  0.994318  0.520665  0.578790  0.734819

In [122]:
labels2

['W', 'X', 'Y', 'Z']

In [127]:
df1 = pd.DataFrame(rand(5,4), index=['A','B','C','D', 'E'], columns=labels2)
df1

          W         X         Y         Z
A  0.351434  0.733568  0.913890  0.700987
B  0.388531  0.942259  0.736491  0.238464
C  0.823774  0.760613  0.394709  0.200188
D  0.712596  0.845309  0.368647  0.436980
E  0.356598  0.239737  0.653378  0.390439

In [128]:
df1['W']

A    0.351434
B    0.388531
C    0.823774
D    0.712596
E    0.356598
Name: W, dtype: float64

In [129]:
type(df1)

pandas.core.frame.DataFrame

In [132]:
type(df1['W'])

pandas.core.series.Series

In [135]:
df1[['W','Z']]

          W         Z
A  0.351434  0.700987
B  0.388531  0.238464
C  0.823774  0.200188
D  0.712596  0.436980
E  0.356598  0.390439

In [152]:
df1['new'] = [10,20,30,40,50]
df1

          W         X         Y         Z       W+X  new
A  0.351434  0.733568  0.913890  0.700987  1.085002   10
B  0.388531  0.942259  0.736491  0.238464  1.330791   20
C  0.823774  0.760613  0.394709  0.200188  1.584387   30
D  0.712596  0.845309  0.368647  0.436980  1.557905   40
E  0.356598  0.239737  0.653378  0.390439  0.596335   50

In [154]:
df1['W+X'] = df1['W'] + df1['X']
df1

          W         X         Y         Z       W+X  new
A  0.351434  0.733568  0.913890  0.700987  1.085002   10
B  0.388531  0.942259  0.736491  0.238464  1.330791   20
C  0.823774  0.760613  0.394709  0.200188  1.584387   30
D  0.712596  0.845309  0.368647  0.436980  1.557905   40
E  0.356598  0.239737  0.653378  0.390439  0.596335   50

In [155]:
df1.drop(['new'], axis=1)

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905
E  0.356598  0.239737  0.653378  0.390439  0.596335

In [156]:
df1

          W         X         Y         Z       W+X  new
A  0.351434  0.733568  0.913890  0.700987  1.085002   10
B  0.388531  0.942259  0.736491  0.238464  1.330791   20
C  0.823774  0.760613  0.394709  0.200188  1.584387   30
D  0.712596  0.845309  0.368647  0.436980  1.557905   40
E  0.356598  0.239737  0.653378  0.390439  0.596335   50

In [157]:
df1.drop(['new'], axis=1, inplace=True)
df1

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905
E  0.356598  0.239737  0.653378  0.390439  0.596335

In [158]:
df1.drop('E')

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905

In [159]:
df1.drop('E', axis=0)

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905

In [161]:
df1

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905
E  0.356598  0.239737  0.653378  0.390439  0.596335

In [162]:
df1.shape

(5, 5)

>Select rows of DataFrame
 for label loc and for index iloc

In [163]:
df1.loc['E']

W      0.356598
X      0.239737
Y      0.653378
Z      0.390439
W+X    0.596335
Name: E, dtype: float64

In [164]:
df1.iloc[4]

W      0.356598
X      0.239737
Y      0.653378
Z      0.390439
W+X    0.596335
Name: E, dtype: float64

> Select row and column

In [166]:
df1

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905
E  0.356598  0.239737  0.653378  0.390439  0.596335

In [167]:
df1.loc[['A','B'], ['X','Z', 'W+X']]

          X         Z       W+X
A  0.733568  0.700987  1.085002
B  0.942259  0.238464  1.330791

>Coditional Selection of DataFrame

In [173]:
df1>0.5

       W      X      Y      Z   W+X
A  False   True   True   True  True
B  False   True   True  False  True
C   True   True  False  False  True
D   True   True  False  False  True
E  False  False   True  False  True

In [174]:
df1[df1>0.5]

          W         X         Y         Z       W+X
A       NaN  0.733568  0.913890  0.700987  1.085002
B       NaN  0.942259  0.736491       NaN  1.330791
C  0.823774  0.760613       NaN       NaN  1.584387
D  0.712596  0.845309       NaN       NaN  1.557905
E       NaN       NaN  0.653378       NaN  0.596335

In [175]:
df1['W'] >0.5

A    False
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [181]:
result1 = df1[df1['W']>0.5]

In [180]:
result1

          W         X         Y         Z       W+X
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905

In [184]:
result1['X']

C    0.760613
D    0.845309
Name: X, dtype: float64

In [185]:
df1[df1['W']>0.5]['X']

C    0.760613
D    0.845309
Name: X, dtype: float64

In [189]:
df1[df1['W']>0.5][['Y','Z']]

          Y         Z
C  0.394709  0.200188
D  0.368647  0.436980

>Multiple condition on dataFrame

In [193]:
df1[(df1['W']>0.5) & (df1['Y']>-1)]

          W         X         Y         Z       W+X
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905

In [195]:
df1[(df1['W']>0.5) | (df1['Y']>1)]

          W         X         Y         Z       W+X
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905

In [198]:
df1

          W         X         Y         Z       W+X
A  0.351434  0.733568  0.913890  0.700987  1.085002
B  0.388531  0.942259  0.736491  0.238464  1.330791
C  0.823774  0.760613  0.394709  0.200188  1.584387
D  0.712596  0.845309  0.368647  0.436980  1.557905
E  0.356598  0.239737  0.653378  0.390439  0.596335

In [200]:
df1.reset_index()

  index         W         X         Y         Z       W+X
0     A  0.351434  0.733568  0.913890  0.700987  1.085002
1     B  0.388531  0.942259  0.736491  0.238464  1.330791
2     C  0.823774  0.760613  0.394709  0.200188  1.584387
3     D  0.712596  0.845309  0.368647  0.436980  1.557905
4     E  0.356598  0.239737  0.653378  0.390439  0.596335

In [202]:
newind = 'BR UP HP MP AP'.split()
newind

['BR', 'UP', 'HP', 'MP', 'AP']

In [204]:
df1['state'] = newind
df1

          W         X         Y         Z       W+X state
A  0.351434  0.733568  0.913890  0.700987  1.085002    BR
B  0.388531  0.942259  0.736491  0.238464  1.330791    UP
C  0.823774  0.760613  0.394709  0.200188  1.584387    HP
D  0.712596  0.845309  0.368647  0.436980  1.557905    MP
E  0.356598  0.239737  0.653378  0.390439  0.596335    AP

In [205]:
df1.set_index('state')

              W         X         Y         Z       W+X
state
BR     0.351434  0.733568  0.913890  0.700987  1.085002
UP     0.388531  0.942259  0.736491  0.238464  1.330791
HP     0.823774  0.760613  0.394709  0.200188  1.584387
MP     0.712596  0.845309  0.368647  0.436980  1.557905
AP     0.356598  0.239737  0.653378  0.390439  0.596335

In [207]:
df1

          W         X         Y         Z       W+X state
A  0.351434  0.733568  0.913890  0.700987  1.085002    BR
B  0.388531  0.942259  0.736491  0.238464  1.330791    UP
C  0.823774  0.760613  0.394709  0.200188  1.584387    HP
D  0.712596  0.845309  0.368647  0.436980  1.557905    MP
E  0.356598  0.239737  0.653378  0.390439  0.596335    AP

In [210]:
df2 = df1.set_index('W+X')
df2

                 W         X         Y         Z state
W+X
1.085002  0.351434  0.733568  0.913890  0.700987    BR
1.330791  0.388531  0.942259  0.736491  0.238464    UP
1.584387  0.823774  0.760613  0.394709  0.200188    HP
1.557905  0.712596  0.845309  0.368647  0.436980    MP
0.596335  0.356598  0.239737  0.653378  0.390439    AP

In [213]:
df2.iloc[0]

W        0.351434
X        0.733568
Y         0.91389
Z        0.700987
state          BR
Name: 1.08500187768125, dtype: object

>**DataFrame Multilevel Index**

In [216]:
outside = 'G1 G1 G1 G2 G2 G2 '.split()
inside = [1,2,3,1,2,3]
higher_index = list(zip(outside, inside))
higher_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [219]:
index_l1 = pd.MultiIndex.from_tuples(higher_index)
index_l1

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [225]:
df = pd.DataFrame(rand(6,2), index_l1, columns=['A', 'B'])
df

             A         B
G1 1  0.872406  0.890708
   2  0.689910  0.915961
   3  0.407195  0.162610
G2 1  0.184091  0.223771
   2  0.001189  0.226782
   3  0.930979  0.738519

In [226]:
df.loc['G1']

          A         B
1  0.872406  0.890708
2  0.689910  0.915961
3  0.407195  0.162610

In [227]:
df.loc['G1'].loc[2]

A    0.689910
B    0.915961
Name: 2, dtype: float64

In [228]:
df.index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [231]:
df.index.names

FrozenList([None, None])

In [232]:
df.columns

Index(['A', 'B'], dtype='object')

In [233]:
df.columns.names

FrozenList([None])

In [235]:
df.index.names = ['Groups', 'num']
df

                   A         B
Groups num
G1     1    0.872406  0.890708
       2    0.689910  0.915961
       3    0.407195  0.162610
G2     1    0.184091  0.223771
       2    0.001189  0.226782
       3    0.930979  0.738519

In [237]:
df.index.names

FrozenList(['Groups', 'num'])

In [241]:
df.columns.name = 'Column name'
df

Column name         A         B
Groups num
G1     1     0.872406  0.890708
       2     0.689910  0.915961
       3     0.407195  0.162610
G2     1     0.184091  0.223771
       2     0.001189  0.226782
       3     0.930979  0.738519

In [242]:
df.columns.names

FrozenList(['Column name'])

In [243]:
df

Column name         A         B
Groups num
G1     1     0.872406  0.890708
       2     0.689910  0.915961
       3     0.407195  0.162610
G2     1     0.184091  0.223771
       2     0.001189  0.226782
       3     0.930979  0.738519

In [250]:
df.loc['G2'].loc[2, 'B']

0.2267816888914913

Cross Section of dataframe

In [252]:
df.xs('G2')

Column name         A         B
num
1            0.184091  0.223771
2            0.001189  0.226782
3            0.930979  0.738519

In [255]:
df.xs('G2', level='Groups')

Column name         A         B
num
1            0.184091  0.223771
2            0.001189  0.226782
3            0.930979  0.738519

In [256]:
df.xs(1, level='num')

Column name         A         B
Groups
G1           0.872406  0.890708
G2           0.184091  0.223771

## Missing data of DataFrame

In [257]:
d = {'A':[1,2, np.nan],'B':[5, np.nan,np.nan], 'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [259]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [261]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [262]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [263]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [264]:
df.dropna(thresh=2, axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [265]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [266]:
df.fillna('VALUE')

       A      B  C
0      1      5  1
1      2  VALUE  2
2  VALUE  VALUE  3

In [268]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [269]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [274]:
df['A'].fillna(value=df['A'].mean() , inplace=True)
df['A']

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Pandas- DataFrame GroupBy

In [280]:
data = {'Cmpany':['Google', 'MicroSoft', 'MicroSoft', 'Facebook', 'Facebook', 'Facebook'], 'Person':['Chandan', 'Abhisheak', 'Rahul', 'Raushan', 'Rajeev', 'Mohan'], 'Sales':[200, 120, 340, 124, 243,350]}
data

{'Cmpany': ['Google',
  'MicroSoft',
  'MicroSoft',
  'Facebook',
  'Facebook',
  'Facebook'],
 'Person': ['Chandan', 'Abhisheak', 'Rahul', 'Raushan', 'Rajeev', 'Mohan'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [281]:
df = pd.DataFrame(data)
df

      Cmpany     Person  Sales
0     Google    Chandan    200
1  MicroSoft  Abhisheak    120
2  MicroSoft      Rahul    340
3   Facebook    Raushan    124
4   Facebook     Rajeev    243
5   Facebook      Mohan    350

In [287]:
byCompany = df.groupby('Cmpany')
byCompany.mean()

           Sales
Cmpany
Facebook     239
Google       200
MicroSoft    230

In [288]:
df.groupby('Cmpany').mean()

           Sales
Cmpany
Facebook     239
Google       200
MicroSoft    230

In [289]:
df.groupby('Cmpany').sum()

           Sales
Cmpany
Facebook     717
Google       200
MicroSoft    460

In [291]:
df.groupby('Cmpany').std()

                Sales
Cmpany
Facebook   113.053085
Google            NaN
MicroSoft  155.563492

In [292]:
df.groupby('Cmpany').std().loc['Facebook']

Sales    113.053085
Name: Facebook, dtype: float64

In [294]:
df.groupby('Cmpany').describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Cmpany
Facebook    3.0  239.0  113.053085  124.0  183.5  243.0  296.5  350.0
Google      1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
MicroSoft   2.0  230.0  155.563492  120.0  175.0  230.0  285.0  340.0

In [296]:
df.groupby('Cmpany').describe().transpose()

Cmpany         Facebook  Google   MicroSoft
Sales count    3.000000     1.0    2.000000
      mean   239.000000   200.0  230.000000
      std    113.053085     NaN  155.563492
      min    124.000000   200.0  120.000000
      25%    183.500000   200.0  175.000000
      50%    243.000000   200.0  230.000000
      75%    296.500000   200.0  285.000000
      max    350.000000   200.0  340.000000

In [298]:
df.groupby('Cmpany').describe().transpose()['Facebook']

Sales  count      3.000000
       mean     239.000000
       std      113.053085
       min      124.000000
       25%      183.500000
       50%      243.000000
       75%      296.500000
       max      350.000000
Name: Facebook, dtype: float64

## Pandas- DataFrame Merging Joining and Concatenating

In [305]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3',], 
                    'B':['B0','B1','B2', 'B3'],
                    'C':['C0','C1', 'C2','C3'],
                    'D':['D0', 'D1', 'D2', 'D3']},
                    index=[0,1,2,3]
                   )
df2 = pd.DataFrame({'A':['A4','A5', 'A6', 'A7',], 
                    'B':['B4','B5', 'B6', 'B7'],
                    'C':['C4','C5', 'C6', 'C7'],
                    'D':['D4','D5', 'D6', 'D7']},
                    index=[4,5,6,7]
                   )
df3 = pd.DataFrame({'A':['A8','A9', 'A10', 'A11',], 
                    'B':['B8','B9', 'B10', 'B11'],
                    'C':['C8','C9', 'C10', 'C11'],
                    'D':['D8','D9', 'D10', 'D11']},
                    index=[8,9,10,11]
                   )

In [307]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [308]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [309]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

>**Concatenation** basically glues together DataFrame, keep in mind that dimensions should math along the axis you are concatenating on. You can use **pd.concat** and pass in a list of dataframe to concatenate together:

In [311]:
pd.concat([df1, df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [312]:
pd.concat([df1, df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [319]:
left = pd.DataFrame({'key':['k0','k1','k2','k3'], 
                    'A' :['A0','A1','A2','A3'],
                    'B':['B0','B1','B2', 'B3']},
                    index=[0,1,2,3]
                   )

right = pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'C':['C0','C1', 'C2','C3'],
                    'D':['D0', 'D1', 'D2', 'D3']},
                    index=[0,1,2,3]
                   )

In [317]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [316]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

## Merging
The **merge** function allows you to merge DataFrame together using a similar logic as merging SQL Table together. For Example:

In [320]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [331]:
leftDf = pd.DataFrame({'key1':['k0','k0','k1','k2'], 
                     'key2':['k0','k1','k0','k1'], 
                    'A' :['A0','A1','A2','A3'],
                    'B':['B0','B1','B2', 'B3']},
                    index=[0,1,2,3]
                   )

rightDF = pd.DataFrame({'key1':['k0','k1','k1','k2'],
                      'key2':['k0','k0','k0','k0'], 
                    'C':['C0','C1', 'C2','C3'],
                    'D':['D0', 'D1', 'D2', 'D3']},
                    index=[0,1,2,3]
                   )

In [329]:
pd.merge(leftDf, rightDF, on= ['key1', 'key2'])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [330]:
pd.merge(leftDf, rightDF, how='outer', on= ['key1', 'key2'])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k1   A3   B3  NaN  NaN
5   k2   k0  NaN  NaN   C3   D3

## Joining
>Joining is a covinent method for combining the columns of two potentially differently-indexed DataFrame into a single result DataFrame.

In [339]:
leftDf = pd.DataFrame({'A' :['A0','A1','A2','A3'],
                    'B':['B0','B1','B2', 'B3']},
                    index=['k0','k1','k2', 'k3']
                   )

rightDF = pd.DataFrame({
                    'C':['C0','C1', 'C2','C3'],
                    'D':['D0', 'D1', 'D2', 'D3']},
                    index=['k0','k1','k2', 'k4']
                   )
leftDf

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2
k3  A3  B3

In [340]:
rightDF

     C   D
k0  C0  D0
k1  C1  D1
k2  C2  D2
k4  C3  D3

In [341]:
leftDf.join(rightDF)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1   C1   D1
k2  A2  B2   C2   D2
k3  A3  B3  NaN  NaN

In [342]:
leftDf.join(rightDF, how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1   C1   D1
k2   A2   B2   C2   D2
k3   A3   B3  NaN  NaN
k4  NaN  NaN   C3   D3

#  Pandas- DataFrame Opertaions

In [345]:
df = pd.DataFrame({'col1':[1,2,3,4],
                    'col2':[444,555,666,444],
                   'col3':['abc', 'def', 'ghi', 'xyz']
                  })
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [346]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [347]:
df['col2'].unique()

array([444, 555, 666])

In [349]:
df['col2'].nunique()

3

In [351]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [354]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [357]:
df[(df['col1']>2) & (df['col2']>500)]

   col1  col2 col3
2     3   666  ghi

In [360]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [362]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [364]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [365]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [366]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [367]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [370]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [371]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [374]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'x', 'y', 'x', 'y'],
        'D': [1,3,2,5,4,1]
       }
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [375]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output with Pandas
   1. CSV
   2. Excle
   3. HTML
   4. SQL